#!/usr/bin/env python
# -*- encoding=utf-8 -*-
# author Y.G
__author__ = 'YangGang'

'''
python 1987 龟叔  面向对象的语言

http://www.cnblogs.com/alex3714/articles/5465198.html

先做需求分析---》流程图--》实现功能--》测试完善==》交付产品--修复bug和不断完善

Blog 一定要写   整理学习点
Readme 一定要写
流程图一定要画


本节内容
1，Python介绍
2，发展史
3，Python 2 or 3?
4，安装
5，Hello World程序
6，变量
7，用户输入
8，模块初识
9，.pyc是个什么鬼？
10，数据类型初识
11，数据运算
12，表达式if ...else语句
13，表达式for 循环
14，break （跳出循环） and continue (跳出本次循环）
15，表达式while 循环
16，作业需求

1-Python高级自动化开发工程师微职位：Python基础（培训班课程，请勿购买） 36
课程目录记笔记提问题
1 开课介绍42:38
2 开课介绍 208:45
3 开课介绍 325:21
4 开课介绍 426:38
5 开课介绍 510:35
6 发展介绍19:14
7 2 与3的选择14:50
8 安装10:55
9 第一个Python程序18:19
10 变量的定义31:51
11 字符编码22:11
12 注释12:19
13 格式化字符串10:59
14 常用模块初识23:23
15 基本的if判断06:53
16 if else 语句15:58
17 猜年龄游戏10:42
18 循环语句14:25
19 作业需求16:24
20 本节鸡汤之Be a new gentlmen51:29
21 上节内容回顾36:24
22 .pyc是个什么鬼24:40
23 常用数据类型12:26
24 列表的语法和使用22:46
25 列表的语法和使用 201:04:31
26 字符串常用操作25:18
27 数据运算57:38
28 海枯石烂死循环09:41
29 NB数据类型之字典的使用41:05
30 完美购物车程序练习44:15
31 完美购物作业需求08:32
32 学习方法04:01
33 上节内容回顾和本节内容介绍20:17
34 set集合37:21
35 set集合练习题08:00
36 set集合练习题实现08:01试卷
'''