#!/usr/bin/env python
# -*- encoding=utf-8 -*-
# -*- coding:utf-8 -*-
# author Y.G
__author__ = 'YangGang'

'''
#作业需求
1.优化购物程序  购买时允许用户选择买多少件
2.允许多用户登陆，下一次登录后，继续按上次的余额继续购买（可以充值)
3.允许用户查看之前的购买记录（记录要显示商品购买时间）
4.商品列表分级展示 ：
  如
  第一层
  1.家电类
  2.衣服
  3.手机类
  4.车类
  。。。
  随便选择一个。比如车类，进入第2层：
    1.BMW X3  33333
    2.Audi Q5  33335
    3.Pasate  2017  33336
    4.Tesla Model 3  48000
5.显示已经购买商品时，如有重复商品 在一行展示
 如
 id   p_name   num  total_price
 1    Tesala    2    800009
 2    Coffee    3    80

 ###############################################
 ##################################################

Blog 一定要写
Readme 一定要写
流程图一定要画
'''