#!/usr/bin/env python
# -*- encoding=utf-8 -*-
# -*- coding:utf-8 -*-
# author Y.G
__author__ = 'YangGang'

'''
数据运算

运算符
+
-
*
/
%
**
//
比较运算符
==
!=
<>
>
<
>=
<=
赋值运算符
=
+=
-=
*=
/=
**=
//=

逻辑运算符  布尔类型
and
or
not

成员运算符
in
not in
身份运算
is
is not


位运算
&   a&b   --->and  按位与运算
|   a|b   ---->or  按位或运算
^   a^b            按位异或运算
`   `a             按位取反运算
<<  a<<2           左移运算
>>  a>>2           右移运算
0-255
-----------------------------------------
1  2  4  8  16  32  64  128   256  512  1024
1  1  1  1   1   1   1   1     1    1     1
0  0  0  0   0   0   0   0     0    0     0

<-----------------------------------------
1024 512  256  128  64   32  16  8  4  2  1
  0   0    0    0   0    0   0   0  0  0  0
  1   1    1    1   1    1   1   1  1  1  1
2**n-1

0 1 0 1 =5
1 0 0 1 =9
1 1 1 0 =14


计算机中最小单位：是一个二进制位
计算机中存储最小单位：是一个二进制位 （bit)

8位可以表示2**8-1=255bit

8bit = byte(字节)

1024byte = 1 kbye
1024kbyte = 1mbyte
1024mbyte = 1gbyte
1024gbyte = 1tbyte

1TB = 1024 GB
1GB = 1024 MB
1MB = 1024 KB
1KB = 1024 B
1B = 8 b





'''